---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.GetSizeInFloats
source: html/27db570f-952f-1b38-b382-0739b01da1b2.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.GetSizeInFloats Method

Gets the amount of storage that the vertex takes up in a buffer, measured in floats.

## Syntax (C#)
```csharp
public static int GetSizeInFloats()
```

## Returns
The number of floats occupied by one vertex of this type.